In [1]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [21]:
l = [4, 8, 15, 16, 23, 42]

In [22]:
l

[4, 8, 15, 16, 23, 42]

In [23]:
df= pd.Series(l)

In [24]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [25]:
l = [1,2,3,4,5,6,7,8,9,0]

In [26]:
d = pd.Series(l)

In [27]:
d

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9    0
dtype: int64

In [28]:
dic = { 'name' : ['alice' , 'Bob', 'Claire'], 'age': [25,30,27], 'gender': ['female','male', 'female']}

In [31]:
df = pd.DataFrame(dic)

In [32]:
df

     name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans: A pandas.Series, on the other hand, is a 1-dimensional labeled array capable of holding data of any type. It is like a single column of data in a DataFrame and can be thought of as a dictionary-like object.a DataFrame is a 2-dimensional labeled data structure .A DataFrame is essentially a collection of Series objects where each Series represents a column of the DataFrame.

In [33]:
df #dataframe

     name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female

In [34]:
df['name']  #pandas series

0     alice
1       Bob
2    Claire
Name: name, dtype: object

In [35]:
type(df['name'])

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [37]:
df.head()

     name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female

In [38]:
df.tail

<bound method NDFrame.tail of      name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female>

In [40]:
df.info

<bound method DataFrame.info of      name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female>

In [41]:
df.describe

<bound method NDFrame.describe of      name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female>

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:
    A pandas Series is mutable, meaning you can modify its elements after creation.Similar to Series, a pandas DataFrame is also mutable. A pandas Panel is immutable, which means once created, you cannot change its data or its structure.

Q7.Create a DataFrame using multiple Series. Explain with an example.

In [2]:
student_name = pd.Series(['harshu','deepak', 'monu','anshu','ankit'])
student_age = pd.Series([19,18,21,23,20])
student_marks = pd.Series([89,78,70,90,95])

In [3]:
data = {'name': student_name, 
       'age' : student_age,
       'marks' : student_marks}

In [4]:
student_df = pd.DataFrame(data)

In [6]:
student_df

     name  age  marks
0  harshu   19     89
1  deepak   18     78
2    monu   21     70
3   anshu   23     90
4   ankit   20     95